Tekla Open API Reference for Tekla Structures 2025
StructuresExtender.SetIsFilter Method
 Associates the IsFilter boolean value with the specified control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void SetIsFilter(
	Control control,
	bool value
)
Public Sub SetIsFilter (
	control As Control,
	value As Boolean
)
Parameters
control
Type: System.Windows.Forms.Control
The control to associate the IsFilter value with.
value
Type: System.Boolean
The IsFilter value to associate with the control.
See Also
Reference
StructuresExtender Class
Tekla.Structures.Dialog Namespace